EEPUXProjects/PICBytes/PIC18F45K20/XC8/#EP55 EEPROM Entire Register Clearing/EEPROM_Entire_Register_Clearing.X/mcc_generated_files/pin_manager.h
/**
  @Generated Pin Manager Header File

  @Company:
    Microchip Technology Inc.

  @File Name:
    pin_manager.h

  @Summary:
    This is the Pin Manager file generated using PIC10 / PIC12 / PIC16 / PIC18 MCUs

  @Description
    This header file provides APIs for driver for .
    Generation Information :
        Product Revision  :  PIC10 / PIC12 / PIC16 / PIC18 MCUs - 1.81.5
        Device            :  PIC18F45K20
        Driver Version    :  2.11
    The generated drivers are tested against the following:
        Compiler          :  XC8 2.20 and above
        MPLAB 	          :  MPLAB X 5.40	
*/

/*
    (c) 2018 Microchip Technology Inc. and its subsidiaries. 
    
    Subject to your compliance with these terms, you may use Microchip software and any 
    derivatives exclusively with Microchip products. It is your responsibility to comply with third party 
    license terms applicable to your use of third party software (including open source software) that 
    may accompany Microchip software.
    
    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER 
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY 
    IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS 
    FOR A PARTICULAR PURPOSE.
    
    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP 
    HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO 
    THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL 
    CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT 
    OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS 
    SOFTWARE.
*/

#ifndef PIN_MANAGER_H
#define PIN_MANAGER_H

/**
  Section: Included Files
*/

#include <xc.h>

#define INPUT   1
#define OUTPUT  0

#define HIGH    1
#define LOW     0

#define ANALOG      1
#define DIGITAL     0

#define PULL_UP_ENABLED      1
#define PULL_UP_DISABLED     0

// get/set Indicator aliases
#define Indicator_TRIS                 TRISBbits.TRISB0
#define Indicator_LAT                  LATBbits.LATB0
#define Indicator_PORT                 PORTBbits.RB0
#define Indicator_WPU                  WPUBbits.WPUB0
#define Indicator_ANS                  ANSELHbits.ANS12
#define Indicator_SetHigh()            do { LATBbits.LATB0 = 1; } while(0)
#define Indicator_SetLow()             do { LATBbits.LATB0 = 0; } while(0)
#define Indicator_Toggle()             do { LATBbits.LATB0 = ~LATBbits.LATB0; } while(0)
#define Indicator_GetValue()           PORTBbits.RB0
#define Indicator_SetDigitalInput()    do { TRISBbits.TRISB0 = 1; } while(0)
#define Indicator_SetDigitalOutput()   do { TRISBbits.TRISB0 = 0; } while(0)
#define Indicator_SetPullup()          do { WPUBbits.WPUB0 = 1; } while(0)
#define Indicator_ResetPullup()        do { WPUBbits.WPUB0 = 0; } while(0)
#define Indicator_SetAnalogMode()      do { ANSELHbits.ANS12 = 1; } while(0)
#define Indicator_SetDigitalMode()     do { ANSELHbits.ANS12 = 0; } while(0)

/**
   @Param
    none
   @Returns
    none
   @Description
    GPIO and peripheral I/O initialization
   @Example
    PIN_MANAGER_Initialize();
 */
void PIN_MANAGER_Initialize (void);

/**
 * @Param
    none
 * @Returns
    none
 * @Description
    Interrupt on Change Handling routine
 * @Example
    PIN_MANAGER_IOC();
 */
void PIN_MANAGER_IOC(void);



#endif // PIN_MANAGER_H
/**
 End of File
*/